{"config": [{"config": {"function_type": "lambda", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-28-bf64f1701837>\u00da\b<lambda>\u00b1\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 32, 120, 3], "name": "lambda_2", "input_dtype": "float32", "trainable": true, "output_shape": null, "arguments": {}}, "class_name": "Lambda"}, {"config": {"activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "nb_row": 4, "nb_col": 4, "name": "convolution2d_5", "init": "normal", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_filter": 12, "bias": true, "b_constraint": null, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_3", "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "nb_row": 4, "nb_col": 4, "name": "convolution2d_6", "init": "normal", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_filter": 18, "bias": true, "b_constraint": null, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}, {"config": {"p": 0.2, "trainable": true, "name": "spatialdropout2d_2"}, "class_name": "SpatialDropout2D"}, {"config": {"activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "nb_row": 3, "nb_col": 3, "name": "convolution2d_7", "init": "normal", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_filter": 24, "bias": true, "b_constraint": null, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_4", "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "nb_row": 3, "nb_col": 3, "name": "convolution2d_8", "init": "normal", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_filter": 32, "bias": true, "b_constraint": null, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "b_constraint": null, "W_regularizer": null, "name": "dense_4", "input_dim": null, "init": "normal", "activity_regularizer": null, "output_dim": 32, "b_regularizer": null, "W_constraint": null, "bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "b_constraint": null, "W_regularizer": null, "name": "dense_5", "input_dim": null, "init": "normal", "activity_regularizer": null, "output_dim": 12, "b_regularizer": null, "W_constraint": null, "bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "b_constraint": null, "W_regularizer": null, "name": "dense_6", "input_dim": null, "init": "normal", "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "W_constraint": null, "bias": true, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}